app/views/users/index.html.erb

    <small class="card-title">Created Events: <%= user.created_events.count %></small>
    <small class="card-title">Visited Events: <%= user.event_visited.count %></small>
---
SELECT COUNT(*) FROM "events" INNER JOIN "visitings" ON "events"."id" = "visitings"."event_id" WHERE "visitings"."user_id" = ?  [["user_id", 2]]