app/helpers/application_helper.rb

  def visit_event_btn(event)
    if event.visitings.exists?(user_id: current_user.id)
---
SELECT 1 AS one FROM "visitings" WHERE "visitings"."event_id" = ? AND "visitings"."user_id" = ? LIMIT ?  [["event_id", 1], ["user_id", 4], ["LIMIT", 1]]