app/controllers/events_controller.rb

  def index
    @events = Event.all.order('created_at DESC')
---
SELECT "events".* FROM "events" ORDER BY created_at DESC

  def create
    @event = current_user.created_events.build(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "place", "date", "created_at", "updated_at", "creator") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Deleting controller"], ["place", "Project"], ["date", "2021-10-05 18:23:00"], ["created_at", "2021-10-05 18:23:58.813482"], ["updated_at", "2021-10-05 18:23:58.813482"], ["creator", 4]]
INSERT INTO "events" ("title", "place", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Newest event"], ["place", "Network"], ["date", "2021-10-05 20:26:00"], ["created_at", "2021-10-05 20:26:56.923179"], ["updated_at", "2021-10-05 20:26:56.923179"], ["creator_id", 4]]

  def destroy
    @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]