app/controllers/users_controller.rb

  def show
    @user = User.find(params[user.id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]